d = input('Калькулятор введите символ +, -, *, /, степень(^) или корень:')
if d == '+':
    print('Выбрано сложение')
    a = float(input('Введите первое число:'))
    b = float(input('Введите второе число:'))
    print(a + b)

elif d == '-':
    print('Выбрано вычитание')
    a = float(input('Введите первое число:'))
    b = float(input('Введите второе число:'))
    print(a - b)
    
elif d == '*':
     print('Выбрано вычитание')
     a = float(input('Введите первое число:'))
     b = float(input('Введите второе число:'))
     print(a * b)

elif d == '/':
    print('Выбрано деление')
    a = float(input('Введите первое число:'))
    b = float(input('Введите второе число:'))
    if b != 0:
        print(a / b)
    else:
        print('На ноль делить нельзя')

elif d == '^':
    print('Выбрано возведение в степень')
    a = float(input('Введите число:'))
    b = float(input('Введите введите степень:'))
    print(a**b)

elif d == 'корень':
    print('Выбрано извлечение корня')
    a = float(input('Введите корень:'))
    print(a**0.5)
